app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('dotlan', 'taskflow147@gmail.com', '$2y$12$DlaYQdDYZ7fvAo7u21DwUuX.1MJ8xjVgOElNATFsPwg2UKtE/kWS.', '2024-10-21 07:47:13', '2024-10-21 07:47:13')