app/Http/Controllers/API/TaskController.php

select * from `tasks` where `tasks`.`id` = '2' and `tasks`.`deleted_at` is null limit 1
---
    public function update($id, Request $request)
    {
        $data = $request->all();
        $data['id'] = $id;
        $task = Task::find($id);