app/Http/Controllers/AttachmentController.php

    public function store(Request $request)
    {
        if ($request->hasFile('file_name')) {
            $addedFiles = []; // Mảng lưu các tệp đã thêm thành công

            foreach ($request->file('file_name') as $index => $file) {
                if ($uploadedFilePath = Storage::put(self::PATH_UPLOAD, $file)) {
                    $fileName = $request->input('name')[$index];
                    $attachment = TaskAttachment::create([
                        'task_id' => $request->task_id,
                        'file_name' => $uploadedFilePath,
                        'name' => $fileName
                    ]);
---
insert into `task_attachments` (`task_id`, `file_name`, `name`, `updated_at`, `created_at`) values ('1', 'task_attachments/Utkhw5IrGchKvbgY3euuFMDRq8Ejc9RH8OEbtfGc.jpg', '1.jpg', '2024-10-27 21:18:11', '2024-10-27 21:18:11')