app/Http/Controllers/BoardController.php

    public function index($workspaceId)
    {
        $userId = Auth::id();

        // Lấy tất cả các bảng trong workspace mà người dùng là người tạo hoặc là thành viên
        $boards = Board::where('workspace_id', $workspaceId)
            ->where(function ($query) use ($userId) {
                // Sửa điều kiện này để so sánh với trường lưu thông tin người tạo, ví dụ: 'created_by'
                $query->where('created_at', $userId)
                    ->orWhereHas('boardMembers', function ($query) use ($userId) {
                    $query->where('user_id', $userId);
                });
            })
            ->with(['workspace', 'boardMembers', 'catalogs.tasks']) // Tải các tasks liên quan
            ->get()
            ->map(function ($board) use ($userId) {
                // Tính tổng số thành viên trong bảng
                $board->total_members = $board->boardMembers->count();
---
select * from `catalogs` where `catalogs`.`board_id` in (1) and `catalogs`.`deleted_at` is null
select * from `workspaces` where `workspaces`.`id` in (1)

    public function store(Request $request)
    {
        $data = $request->except(['image', 'link_invite']);
        if ($request->hasFile('image')) {
            $data['image'] = Storage::put(self::PATH_UPLOAD, $request->file('image'));
        }
        $uuid = Str::uuid();
        $token = Str::random(40);
        $data['link_invite'] = url("taskflow/invite/b/{$uuid}/{$token}");
        try {
            DB::transaction(function () use ($data) {
                $board = Board::query()->create($data);
                BoardMember::query()->create([
                    'user_id' => auth()->id(),
                    'board_id' => $board->id,
                    'authorize' => 'Owner',
                    'invite' => now(),
                ]);
---
insert into `boards` (`name`, `workspace_id`, `access`, `link_invite`, `updated_at`, `created_at`) values ('hjkfhsdjfhsdo', '1', 'private', 'http://127.0.0.1:8000/taskflow/invite/b/019275a2-e8f7-48c6-8a03-82f5d8496ca2/LaU1Aoz2VkN7pkb84Lno9OSFSgGfwf02g6vY6bVC', '2024-10-21 08:07:35', '2024-10-21 08:07:35')
insert into `board_members` (`user_id`, `board_id`, `authorize`, `invite`, `updated_at`, `created_at`) values (2, 1, 'Owner', '2024-10-21 08:07:35', '2024-10-21 08:07:35', '2024-10-21 08:07:35')

    public function edit(Request $request, string $id)
    {


        $board = Board::query()->findOrFail($id);
        $colors = Color::query()->get();
        session([
            'board' => $board,
            'colors' => $colors ,
        ]);

        $viewType = \request('viewType', 'board');

        // https://laravel.com/docs/10.x/eloquent-relationships#lazy-eager-loading
        // https://laravel.com/docs/10.x/eloquent-relationships#nested-eager-loading
        $board->load([
            'members',
            'tags',
            'users',
            'catalogs' => function ($query) use ($request) {
                $query->with(['tasks' => function ($taskQuery) use ($request) {
                    $taskQuery->with([
                        'catalog:id,name',
                        'members',
                        'checkLists',
                        'checkLists.checkListItems',
                        'checkLists.checkListItems.checkListItemMembers',
                        'checkLists.checkListItems.checkListItemMembers.user',
                        'tags',
                        'followMembers',
                        'attachments',
                        'taskComments'
                    ])->where(function ($subQuery) use ($request) {

                        // Điều kiện 1: Lọc thành viên
                        if ($request->has('no_member') || $request->has('it_me')) {
                            $subQuery->where(function ($query) use ($request) {
                                if ($request->no_member) {
                                    $query->whereDoesntHave('members');
                                }
                                if ($request->it_me) {
                                    $query->orWhereHas('members', function ($memberQuery) {
---
select * from `boards` where `boards`.`id` = '1' limit 1
select * from `colors`
select * from `check_list_items` where `check_list_items`.`check_list_id` in (1, 2, 3, 4)
select * from `check_lists` where `check_lists`.`task_id` in (1)
select * from `follow_members` where `follow_members`.`task_id` in (1)
select * from `catalogs` where `catalogs`.`board_id` in (6) and `catalogs`.`deleted_at` is null
select * from `check_lists` where `check_lists`.`task_id` in (2, 3, 4, 5)
select * from `follow_members` where `follow_members`.`task_id` in (2, 3, 4, 5)
select * from `task_attachments` where `task_attachments`.`task_id` in (2, 3, 4, 5)


                        // Điều kiện 3: Lọc theo nhãn
                        if ($request->has('no_tags') || $request->has('tags')) {
                            $subQuery->where(function ($tagQuery) use ($request) {
                                if ($request->no_tags) {
                                    $tagQuery->doesntHave('tags');
                                }
                                if ($request->tags) {
                                    $tagQuery->whereHas('tags', function ($tagSubQuery) use ($request) {
                                        $tagSubQuery->whereIn('tags.id', $request->tags);
                                    });
                                }
                            });
---
select * from `tags` where `tags`.`board_id` in (1)

            $viewType = $request->viewType;
            //            $this->middleware('csrf', ['except' => ['edit']]);
        }
        $boardMemberMain = BoardMember::query()
            ->join('users', 'users.id', '=', 'board_members.user_id')
            ->select('users.name', 'users.image', 'board_members.is_accept_invite', 'board_members.authorize', 'users.id as user_id', 'board_members.id as bm_id')
            ->where('board_members.board_id', $board->id)
            ->get();
---
select `users`.*, `board_members`.`board_id` as `pivot_board_id`, `board_members`.`user_id` as `pivot_user_id`, `board_members`.`authorize` as `pivot_authorize`, `board_members`.`is_star` as `pivot_is_star`, `board_members`.`follow` as `pivot_follow`, `board_members`.`invite` as `pivot_invite`, `board_members`.`created_at` as `pivot_created_at`, `board_members`.`updated_at` as `pivot_updated_at` from `users` inner join `board_members` on `users`.`id` = `board_members`.`user_id` where `board_members`.`board_id` in (1)
select `users`.`name`, `users`.`image`, `board_members`.`is_accept_invite`, `board_members`.`authorize`, `users`.`id` as `user_id`, `board_members`.`id` as `bm_id` from `board_members` inner join `users` on `users`.`id` = `board_members`.`user_id` where `board_members`.`board_id` = 1 and `board_members`.`deleted_at` is null

         * flatten(): Dùng để chuyển đổi một collection lồng vào nhau thành một collection phẳng, chứa tất cả các tasks.
         * */
        //        $boardId = $board->id; // ID của bảng mà bạn muốn xem hoạt động
        $activities = Activity::with('causer')
            ->where('properties->board_id', $id)
            ->orderBy('created_at', 'desc')
            ->get();
---
select `users`.*, `board_members`.`board_id` as `pivot_board_id`, `board_members`.`user_id` as `pivot_user_id`, `board_members`.`authorize` as `pivot_authorize`, `board_members`.`is_star` as `pivot_is_star`, `board_members`.`follow` as `pivot_follow`, `board_members`.`invite` as `pivot_invite`, `board_members`.`created_at` as `pivot_created_at`, `board_members`.`updated_at` as `pivot_updated_at` from `users` inner join `board_members` on `users`.`id` = `board_members`.`user_id` where `board_members`.`board_id` in (1)


        // Kiểm tra và cập nhật tất cả thành viên đã được mời vào workspace cùng một lần truy vấn
        $userIds = $boardMemberInvites->pluck('user_id')->toArray();
        $invitedWorkspaceMembers = WorkspaceMember::whereIn('user_id', $userIds)
            ->where('workspace_id', $board->workspace_id)
            ->get();


        BoardMember::whereIn('user_id', $invitedWorkspaceMembers->pluck('user_id'))
            ->where('board_id', $board->id)
            ->update(['is_accept_invite' => 0]);
---
select * from `workspace_members` where `user_id` in (2) and `workspace_id` = 1 and `workspace_members`.`deleted_at` is null
update `board_members` set `is_accept_invite` = 0, `board_members`.`updated_at` = '2024-10-24 21:22:24' where `user_id` in (2) and `board_id` = 1 and `board_members`.`deleted_at` is null

            return $member->user_id == Auth::id();
        })->first();
        // Lấy danh sách thành viên của workspace mà chưa phải là thành viên của bảng
        $wspMember = WorkspaceMember::query()
            ->join('users', 'users.id', '=', 'workspace_members.user_id')
            ->leftJoin('board_members', function ($join) use ($board) {
                $join->on('workspace_members.user_id', '=', 'board_members.user_id')
                    ->where('board_members.board_id', '=', $board->id);
            })
            ->select('users.id', 'users.name')
            ->whereNull('board_members.user_id') // Thành viên chưa có trong bảng
            ->where('workspace_members.workspace_id', $board->workspace_id)
            ->where('workspace_members.authorize', '!=', 'Viewer') // Lọc những người không phải Viewer
            ->get();
---
select `users`.`id`, `users`.`name` from `workspace_members` inner join `users` on `users`.`id` = `workspace_members`.`user_id` left join `board_members` on `workspace_members`.`user_id` = `board_members`.`user_id` and `board_members`.`board_id` = 1 where `board_members`.`user_id` is null and `workspace_members`.`workspace_id` = 1 and `workspace_members`.`authorize` != 'Viewer' and `workspace_members`.`deleted_at` is null

            case 'calendar':
                $listEvent = array();

                $taskCalendar = Task::query()
                    ->whereHas('catalog', function ($query) use ($id) {
                        $query->where('board_id', $id);
                    })
                    ->get()
                    ->filter(function ($task) {
                        // Nếu cả hai đều không tồn tại, ẩn
                        if (is_null($task->start_date) && is_null($task->end_date)) {
                            return false;
                        }

                        // Nếu chỉ tồn tại một trong hai, gán giá trị của cái còn lại
                        if (is_null($task->start_date)) {
                            $task->start_date = $task->end_date;
                        } elseif (is_null($task->end_date)) {
                            $task->end_date = $task->start_date;
                        }
                        // Hiển thị task nếu đã xử lý xong
                        return true;
                    });
---
select * from `tasks` where exists (select * from `catalogs` where `tasks`.`catalog_id` = `catalogs`.`id` and `board_id` = '6' and `catalogs`.`deleted_at` is null) and `tasks`.`deleted_at` is null

    public function update(Request $request, string $id)
    {
        $board = Board::query()->findOrFail($id);
        $data = $request->except(['_token', '_method', 'image']);
        if ($request->hasFile('image')) {
            $imagePath = Storage::put(self::PATH_UPLOAD, $request->file('image'));
            $data['image'] = $imagePath;
            if ($board->image && Storage::exists($board->image)) {
                Storage::delete($board->image);
            }
        }

        $board->update($data);
---
select * from `boards` where `boards`.`id` = '1' limit 1
update `boards` set `name` = 'bảng 1', `boards`.`updated_at` = '2024-10-25 20:23:47' where `id` = 1

            }
        } //xử lý khi người dùng có link invite và kick vô
        else {
            $board = Board::where('link_invite', 'LIKE', "%$uuid/$token%")->first();
---
select * from `boards` where `link_invite` LIKE '%ba5f6eb2-c3da-435f-a1ba-b9cb82315afc/PzLvLmUbMbsnRWdWBgp1dzt1IHeT2Qet78bhMSMh%' limit 1