app/Http/Controllers/BoardController.php

select * from `tasks` where `tasks`.`catalog_id` in (1) and `tasks`.`deleted_at` is null order by `position` asc
---
    public function edit($id)
    {
        $board = Board::query()->findOrFail($id);

        session(['board' => $board]);

        $viewType = \request('viewType', 'board');

        // https://laravel.com/docs/10.x/eloquent-relationships#lazy-eager-loading
        // https://laravel.com/docs/10.x/eloquent-relationships#nested-eager-loading
        $board->load([
            'users',
            // 'members',
            'catalogs',
            'catalogs.tasks',
            'catalogs.tasks.catalog:id,name',
            'catalogs.tasks' => function ($query) {
                $query->orderBy('position', 'asc');
            },

            'catalogs.tasks.members'
        ]);