app/Http/Controllers/BoardController.php

select * from `check_list_item_members` where `check_list_item_members`.`check_list_item_id` in (5, 6, 7, 8)
select * from `check_list_items` where `check_list_items`.`check_list_id` in (3, 4, 5)
select * from `check_lists` where `check_lists`.`task_id` in (1)
select * from `follow_members` where `follow_members`.`task_id` in (1)
---
    public function edit(Request $request, string $id)
    {

        $board = Board::query()->findOrFail($id);
        $colors = Color::query()->get();
        session([
            'board' => $board,
            'colors' => $colors,
        ]);
        $viewType = \request('viewType', 'board');
        // https://laravel.com/docs/10.x/eloquent-relationships#lazy-eager-loading
        // https://laravel.com/docs/10.x/eloquent-relationships#nested-eager-loading
        $board->load([
            'members',
            'tags',
            'users',
            'catalogs' => function ($query) use ($request) {
                $query->with([
                    'tasks' => function ($taskQuery) use ($request) {
                        $taskQuery->with([
                            'catalog:id,name',
                            'members',
                            'checkLists',
                            'checkLists.checkListItems',
                            'checkLists.checkListItems.checkListItemMembers',
                            'checkLists.checkListItems.checkListItemMembers.user',
                            'checkLists.checkListItems.members',
                            'tags',
                            'followMembers',
                            'attachments',
                            'taskComments',
                            'taskComments.user',
                        ])->where(function ($subQuery) use ($request) {
                            if (!empty($request->search)) {
                                $subQuery->where('text', 'LIKE', "%{$request->search}%");
                            }
                            // Điều kiện 1: Lọc thành viên
                            if ($request->has('no_member') || $request->has('it_me')) {
                                $subQuery->where(function ($query) use ($request) {
                                    if ($request->no_member) {
                                        $query->whereDoesntHave('members');
                                    }
                                    if ($request->it_me) {
                                        $query->orWhereHas('members', function ($memberQuery) {
                                            $memberQuery->where('user_id', auth()->id());
                                        });
                                    }
                                });
                            }

                            // Điều kiện 2: Lọc ngày hết hạn
                            if ($request->has('no_date') || $request->has('no_overdue') || $request->has('due_tomorrow')) {
                                $subQuery->where(function ($dateQuery) use ($request) {

select * from `tags` where `tags`.`board_id` in (1)
---

                            // Điều kiện 3: Lọc theo nhãn
                            if ($request->has('no_tags') || $request->has('tags')) {
                                $subQuery->where(function ($tagQuery) use ($request) {
                                    if ($request->no_tags) {
                                        $tagQuery->doesntHave('tags');
                                    }
                                    if ($request->tags) {
                                        $tagQuery->whereHas('tags', function ($tagSubQuery) use ($request) {
                                            $tagSubQuery->whereIn('tags.id', $request->tags);
                                        });
                                    }
                                });

select `users`.`id`, `users`.`name` from `workspace_members` inner join `users` on `users`.`id` = `workspace_members`.`user_id` left join `board_members` on `workspace_members`.`user_id` = `board_members`.`user_id` and `board_members`.`board_id` = 1 where `board_members`.`user_id` is null and `workspace_members`.`workspace_id` = 1 and `workspace_members`.`authorize` != 'Viewer' and `workspace_members`.`deleted_at` is null
---
            return $member->user_id == Auth::id();
        })->first();
        // Lấy danh sách thành viên của workspace mà chưa phải là thành viên của bảng
        $wspMember = WorkspaceMember::query()
            ->join('users', 'users.id', '=', 'workspace_members.user_id')
            ->leftJoin('board_members', function ($join) use ($board) {
                $join->on('workspace_members.user_id', '=', 'board_members.user_id')
                    ->where('board_members.board_id', '=', $board->id);
            })
            ->select('users.id', 'users.name')
            ->whereNull('board_members.user_id') // Thành viên chưa có trong bảng
            ->where('workspace_members.workspace_id', $board->workspace_id)
            ->where('workspace_members.authorize', '!=', 'Viewer') // Lọc những người không phải Viewer
            ->get();