app/Http/Controllers/ChecklistController.php

select * from `check_lists` where `id` = '28' limit 1
---
    public function createChecklistItem(Request $request)
    {

        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->except(['_token', '_method']);
        $checkListItem = CheckListItem::create($data);
        return response()->json([
            'success' => "them ChecklistItem thành công",
            'msg' => true,
            'checkListItem' => $checkListItem,
            'check_list_id' => $checkListItem->check_list_id,
            'id' => $checkListItem->id,
            'is_complete' => $checkListItem->is_complete,
            'start_date' => $checkListItem->start_date,
            'end_date' => $checkListItem->end_date,
            'reminder_date' => $checkListItem->reminder_date,
            'task_id' => CheckList::with('checkListItems')
                ->where('id', $checkListItem->check_list_id)->value('task_id'),
        ]);