app/Http/Controllers/ChecklistController.php

insert into `check_lists` (`task_id`, `name`, `updated_at`, `created_at`) values ('1', 'thanh', '2024-10-27 18:08:17', '2024-10-27 18:08:17')
---
    public function create(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->except(['_token', '_method']);
        $checkList = CheckList::create($data);

insert into `check_list_items` (`check_list_id`, `name`, `updated_at`, `created_at`) values ('9', 'thawms', '2024-10-27 18:10:56', '2024-10-27 18:10:56')
select * from `check_list_items` where `check_list_items`.`check_list_id` in (0)
select `task_id` from `check_lists` where `id` = '2' limit 1
select `task_id` from `check_lists` where `id` = '9' limit 1
---
    public function createChecklistItem(Request $request)
    {

        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->except(['_token', '_method']);
        $checkListItem = CheckListItem::create($data);
        return response()->json([
            'success' => "them ChecklistItem thành công",
            'msg' => true,
            'checkListItem' => $checkListItem,
            'check_list_id'=>$checkListItem->check_list_id,
            'id' => $checkListItem->id,
            'is_complete' => $checkListItem->is_complete,
            'start_date' => $checkListItem->start_date,
            'end_date' => $checkListItem->end_date,
            'reminder_date' => $checkListItem->reminder_date,
            'task_id' => CheckList::with('checkListItems')
                ->where('id',  $checkListItem->check_list_id)->value('task_id'),
        ]);

select * from `check_list_items` where `check_list_items`.`id` = '37' limit 1
update `check_list_items` set `is_complete` = '1', `check_list_items`.`updated_at` = '2024-10-28 15:58:54' where `id` = 37
---
    public function updateChecklistItem(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $checkListItem = CheckListItem::query()->findOrFail($request->id);
        $data = $request->only(['reminder_date', 'end_date', 'start_date', 'is_complete']);
        $checkListItem->update($data);

insert into `check_list_item_members` (`user_id`, `check_list_item_id`, `updated_at`, `created_at`) values ('1', '1', '2024-10-27 17:44:52', '2024-10-27 17:44:52')
---
    public function addMemberChecklist(Request $request)
    {
        session()->forget('view_only');
        $data = $request->except(['_token', '_method']);
        CheckListItemMember::create($data);

select * from `check_list_item_members` where `check_list_item_id` = '2' and `user_id` = '2' limit 1
---
    public function deleteMemberChecklist(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $checklistItem = CheckListItemMember::where('check_list_item_id', $request->check_list_item_id)
            ->where('user_id', $request->user_id)
            ->first();

select * from `check_list_items` where `check_list_items`.`id` = '5' limit 1
---
    public function getFormAddMember(Request $request, $checkListItemId)
    {
        $boardMembers0 = session('boardMembers_' . $request->boardId);
        $boardMembers = json_decode(json_encode($boardMembers0));

        $checklistItem = json_decode(json_encode(CheckListItem::with('members')->findOrFail($checkListItemId)));

select * from `check_lists` where `id` = '11' limit 1
---
    public function deleteChecklist(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $checkList = CheckList::with(['checkListItems.checkListItemMembers'])
            ->where('id', $request->id)
            ->first();

select * from `check_list_item_members` where `check_list_item_members`.`check_list_item_id` in (15)
select * from `check_list_items` where `id` = '15' limit 1
delete from `check_list_items` where `id` = 15
---
    public function deleteChecklistItem(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $checkListItem = CheckListItem::with(['checkListItemMembers'])
            ->where('id', $request->id)
            ->first();
        if ($checkListItem) {
            foreach ($checkListItem->checkListItemMembers as $checkListMember) {
                $checkListMember->delete();
            }

            $checkListItem->delete();