app/Http/Controllers/CommentController.php

    public function store(Request $request)
    {
         if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->except(['_token', '_method']);
        $taskComment=TaskComment::create($data);
         $userOwnerID=BoardMember::where('board_id',$taskComment->task->catalog->board->id)
             ->where('user_id','Owner')
             ->value('user_id');
---
insert into `task_comments` (`content`, `user_id`, `task_id`, `updated_at`, `created_at`) values ('<p>heheh</p>', '1', '1', '2024-10-27 17:22:52', '2024-10-27 17:22:52')
select `user_id` from `board_members` where `board_id` = 1 and `user_id` = 'Owner' and `board_members`.`deleted_at` is null limit 1

    public function destroy(Request $request , string $id)
    {
        $comment = TaskComment::where('id', $request->id)->first();
            $comment->delete();
---
select * from `task_comments` where `id` = '5' and `task_comments`.`deleted_at` is null limit 1
update `task_comments` set `deleted_at` = '2024-10-27 17:55:15', `task_comments`.`updated_at` = '2024-10-27 17:55:15' where `id` = 5