app/Http/Controllers/CommentController.php

    public function store(Request $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $task = Task::query()->findOrFail($request->task_id);
---
select * from `tasks` where `tasks`.`id` = '1' and `tasks`.`deleted_at` is null limit 1