app/Http/Controllers/GoogleApiClientController.php

select `access_token` from `users` where `id` is null limit 1
---
    public function createEvent($data)
    {
        if (isset($data['start']) || isset($data['end'])) {
            $startDate = $data['start'] == 'Invalid date' ? $data['end'] : $data['start'];
            $endDate = $data['end'];
        } else {
            $startDate = $data['start_date'] == 'Invalid date' ? $data['end_date'] : $data['start_date'];
            $endDate = $data['end_date'];
        }

        $description = isset($data['description']) ? $data['description'] : '';
        $summary = isset($data['text']) ? $data['text'] : '';

//        $accessToken = session('google_access_token');
        $accessToken = User::query()
            ->where('id', auth()->id())
            ->value('access_token');