app/Http/Controllers/HomeController.php

select count(*) as aggregate from `tasks` where `catalog_id` in (1, 2) and `progress` = 1 and `tasks`.`deleted_at` is null
---

            // Tính tổng số nhiệm vụ và tổng progress của các task trong bảng
            $totalTasks = $board->catalogs->pluck('tasks')->flatten()->count();
            $totalProgress = $board->catalogs->pluck('tasks')->flatten()->sum('progress');