app/Http/Controllers/HomeController.php

    public function index()
    {

        $userId = Auth::id();

        // Lấy tất cả các bảng mà người dùng tạo hoặc thuộc về workspace
        $boards = Board::whereHas('workspace.workspaceMembers', function ($query) use ($userId) {
            $query->where('is_active', 1)->where('user_id', $userId); // Người dùng là thành viên của workspace
        })
        ->with(['workspace', 'boardMembers']) // Tải thông tin workspace và boardMembers
        ->get()
        ->map(function ($board) {
            // Tính tổng số thành viên trong bảng
            $board->total_members = $board->boardMembers->count();

            // Kiểm tra xem bảng có được đánh dấu sao không
            $board->is_star = $board->boardMembers->contains(fn($member) => $member->is_star == 1);

            // Kiểm tra follow = 1
            $board->follow = $board->boardMembers->contains(fn($member) => $member->follow == 1);

            // Đếm số thành viên theo dõi bảng
            $board->total_followers = $board->boardMembers->where('follow', 1)->count();

            return $board;
        });
---
select * from `boards` where exists (select * from `workspaces` where `boards`.`workspace_id` = `workspaces`.`id` and exists (select * from `workspace_members` where `workspaces`.`id` = `workspace_members`.`workspace_id` and `is_active` = 1 and `user_id` = 2 and `workspace_members`.`deleted_at` is null))
select * from `workspaces` where `workspaces`.`id` in (1)

        $board_star = $boards->filter(fn($board) => $board->is_star);

        // lấy tất cả các thành viên trong ws mà người dùng đang trong ws đấy
        $workspaceMembers = WorkspaceMember::with([
            'user',
            'workspace.boards.boardMembers' => function ($query) {
                $query->whereNull('deleted_at'); // Lọc các thành viên trong bảng không bị xóa
            }
        ])
        ->whereIn('workspace_id', function ($query) use ($userId) {
            $query->select('workspace_id')
                ->from('workspace_members')
                ->where('user_id', $userId)
                ->where('is_active', 1);
        })
        ->whereNull('deleted_at') // Chỉ lấy những thành viên không bị xóa (nếu có soft delete)
        ->get();

        // Lấy tất cả các task trong các workspace mà user là thành viên
        $tasks = Task::with(['catalog.board.workspace', 'catalog.board.boardMembers', 'members'])
        ->whereIn('catalog_id', function ($query) use ($userId) {
            $query->select('catalogs.id')
                ->from('catalogs')
                ->join('boards', 'catalogs.board_id', '=', 'boards.id')
                ->join('workspaces', 'boards.workspace_id', '=', 'workspaces.id')
                ->join('workspace_members', 'workspaces.id', '=', 'workspace_members.workspace_id')
                ->where('workspace_members.user_id', $userId)
                ->where('workspace_members.is_active', 1)
                ->whereNull('workspace_members.deleted_at');
        })
        ->get()
        ->map(function ($task) {
            // Lấy trực tiếp thông tin từ quan hệ của task
            $task->catalog_name = $task->catalog->name;
            $task->board_name = $task->catalog->board->name;
            $task->board_id = $task->catalog->board->id;

            return $task;
        });
---
select count(*) as aggregate from `workspace_members` where `workspace_id` in (1) and `is_active` = 1 and `workspace_members`.`deleted_at` is null
select * from `boards` where `boards`.`workspace_id` in (1)
select * from `users` where `users`.`id` in (1, 2)
select * from `workspace_members` where `workspace_id` in (select `workspace_id` from `workspace_members` where `user_id` = 2 and `is_active` = 1) and `deleted_at` is null and `workspace_members`.`deleted_at` is null
select * from `boards` where `boards`.`id` in (1)
select * from `catalogs` where `catalogs`.`id` in (1) and `catalogs`.`deleted_at` is null
select * from `tasks` where `catalog_id` in (select `catalogs`.`id` from `catalogs` inner join `boards` on `catalogs`.`board_id` = `boards`.`id` inner join `workspaces` on `boards`.`workspace_id` = `workspaces`.`id` inner join `workspace_members` on `workspaces`.`id` = `workspace_members`.`workspace_id` where `workspace_members`.`user_id` = 2 and `workspace_members`.`is_active` = 1 and `workspace_members`.`deleted_at` is null) and `tasks`.`deleted_at` is null
select * from `workspaces` where `workspaces`.`id` in (1)