app/Http/Controllers/TaskController.php

select max(`position`) as aggregate from `tasks` where `catalog_id` = '1' and `tasks`.`deleted_at` is null
insert into `tasks` (`text`, `parent`, `start_date`, `end_date`, `catalog_id`, `position`, `sortorder`, `creator_email`, `risk`, `priority`, `updated_at`, `created_at`) values ('tuan123@', null, '2024-10-19T18:48', '2024-10-20T18:48', '2', 3, 3, 'nguyengiangtuan0@gmail.com', 'Medium', 'Medium', '2024-10-19 11:56:37', '2024-10-19 11:56:37')
---
    public function store(StoreTaskRequest $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->except(['position', 'priority', 'risk', 'sortorder']);
        if (isset($data['start']) || isset($data['end'])) {
            $data['start_date'] = $data['start'] == 'Invalid date' ? $data['end'] : $data['start'];
            $data['end_date'] = $data['end'];
        }

        $maxPosition = \App\Models\Task::where('catalog_id', $request->catalog_id)
            ->max('position');
        $data['position'] = $maxPosition + 1;
        $maxSortorder = \App\Models\Task::where('catalog_id', $request->catalog_id)
            ->max('sortorder');
        $data['sortorder'] = $maxSortorder + 1;
        $data['creator_email'] = Auth::user()->email;
        $data['risk'] = $data['risk'] ?? 'Medium';
        $data['priority'] = $data['priority'] ?? 'Medium';
//        dd($data['start'], $data['end']);
        $task = Task::query()->create($data);

select * from `tasks` where `tasks`.`id` = '1' and `tasks`.`deleted_at` is null limit 1
---
    public function update(string $id, UpdateTaskRequest $request)
    {


        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');

        $task = Task::query()->findOrFail($id);