app/Http/Controllers/TaskController.php

    public function store(StoreTaskRequest $request)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $catalog = Catalog::query()->findOrFail($request->catalog_id);
---
select * from `catalogs` where `catalogs`.`id` = '1' and `catalogs`.`deleted_at` is null limit 1

    public function updateFolow(Request $request, string $id)
    {
        if (session('view_only', false)) {
            return back()->with('error', 'Bạn chỉ có quyền xem và không thể chỉnh sửa bảng này.');
        }
        session()->forget('view_only');
        $data = $request->only(['user_id']);
        $userId = $data['user_id'];

        $taskMemberFollow = Follow_member::where('task_id', $id)
            ->where('user_id', $userId)
            ->first();
---
select * from `task_members` where `task_id` = '1' and `user_id` = '1' limit 1

    public function destroyTask(string $id)
    {
        $task = Task::withTrashed()->findOrFail($id);
---
select * from `tasks` where `tasks`.`id` = '11' and `tasks`.`deleted_at` is null limit 1

    public function copyTask(Request $request)
    {
        $data = $request->all();
        $task = Task::query()->findOrFail($data['id']);
---
select * from `tasks` where `tasks`.`id` = '1' and `tasks`.`deleted_at` is null limit 1