app/Http/Controllers/UserController.php

select `id`, `name`, `members_hash` from `room_chat`
select * from `users` where `id` = '2' limit 1
---
                )
                ->distinct()
                ->get();
            $rooms = DB::table('room_chat')
                ->select('id', 'name', 'members_hash')
                ->get()->toArray();
            // dd(explode(',', $rooms[0]->members_hash));
            if ($receiverId) {
                // Truy vấn đến bảng users để lấy bản ghi với id == receiverId
                $userss = DB::table('users')->where('id', $receiverId)->first();