app/Http/Controllers/WorkspaceController.php

    public function store(Request $request)
    {
        // Session::flush();

        Log::debug('check');

        $data = $request->except('image');
        if ($request->hasFile('image')) {
            $data['image'] = Storage::put(self::PATH_UPLOAD, $request->file('image'));
        }
        $data['access'] = $data['access'] ?? 'private';
        $uuid = Str::uuid();
        $token = Str::random(40);
        $data['link_invite'] = url("taskflow/invite/{$uuid}/{$token}");
        $is_active = 1;
        try {
            DB::beginTransaction();
            $workspace = Workspace::query()->create($data);
            Log::info('Form submitted by user: ' . auth()->id());
            $workspaceMember = WorkspaceMember::query()
                ->create([
                    'user_id' => auth()->id(),
                    'workspace_id' => $workspace->id,
                    'authorize' => 'Owner',
                    'invite' => now(),
                    'is_active' => $is_active,
                ]);
---
insert into `workspaces` (`name`, `description`, `access`, `link_invite`, `updated_at`, `created_at`) values ('cắùidhgaewiudfqưad', null, 'private', 'http://127.0.0.1:8000/taskflow/invite/3d1de523-04be-4187-a1d0-a3e889b68c5c/YIFwRbHOPpZqNNok1RjzBIfMkApcwUscaDY9UEne', '2024-10-22 15:43:33', '2024-10-22 15:43:33')
insert into `workspace_members` (`user_id`, `workspace_id`, `authorize`, `invite`, `is_active`, `updated_at`, `created_at`) values (3, 3, 'Owner', '2024-10-22 15:43:33', 1, '2024-10-22 15:43:33', '2024-10-22 15:43:33')

                ->withProperties(['workspace_name' => $workspace->name]) // Thông tin bổ sung
                ->log('Người dùng đã tạo không gian làm việc mới.');
            //           update lai cot is_active khi tao ws moi
            WorkspaceMember::query()
                ->where('user_id', auth()->id())
                ->whereNot('id', $workspaceMember->id)
                ->update(['is_active' => 0]);
---
update `workspace_members` set `is_active` = 0, `workspace_members`.`updated_at` = '2024-10-22 15:43:33' where `user_id` = 3 and not `id` = 3 and `workspace_members`.`deleted_at` is null

    public function showFormEditWorkspace()
    {
        $userId = Auth::id();
        $user = Auth::user();
        $userName = $user->name;

        $workspaceChecked = Workspace::query()
            ->select('*', 'workspaces.id as id', 'workspace_members.id as wm_id', 'workspaces.name as wsp_name')
            ->join('workspace_members', 'workspaces.id', 'workspace_members.workspace_id')
            ->where('workspace_members.user_id', $userId)
            ->where('workspace_members.is_active', 1)
            ->first();


        $workspaceMembers = WorkspaceMember::query()
            ->select('workspace_members.*', 'workspace_members.id as wm_id', 'users.id as user_id', 'users.name as name', 'workspaces.name as wsp_name')
            ->join('users', 'users.id', 'workspace_members.user_id')
            ->join('workspaces', 'workspaces.id', 'workspace_members.workspace_id')
            ->where('workspace_members.workspace_id', $workspaceChecked->workspace_id)
            ->get();
---
select *, `workspaces`.`id` as `id`, `workspace_members`.`id` as `wm_id`, `workspaces`.`name` as `wsp_name` from `workspaces` inner join `workspace_members` on `workspaces`.`id` = `workspace_members`.`workspace_id` where `workspace_members`.`user_id` = 1 and `workspace_members`.`is_active` = 1 limit 1
select `workspace_members`.*, `workspace_members`.`id` as `wm_id`, `users`.`id` as `user_id`, `users`.`name` as `name`, `workspaces`.`name` as `wsp_name` from `workspace_members` inner join `users` on `users`.`id` = `workspace_members`.`user_id` inner join `workspaces` on `workspaces`.`id` = `workspace_members`.`workspace_id` where `workspace_members`.`workspace_id` = 1 and `workspace_members`.`deleted_at` is null

    public function update_ws_access(Request $request)
    {
        $user = Auth::user();
        $workspaceAuthorize = WorkspaceMember::query()
            ->with('workspace')
            ->where('user_id', $user->id)
            ->where('is_active', 1)
            ->first();
        if ($workspaceAuthorize->authorize->value !== AuthorizeEnum::Owner()->value && $workspaceAuthorize->authorize->value !== AuthorizeEnum::Sub_Owner()->value) {
---
select * from `workspaces` where `id` = '1' limit 1