app/Models/User.php

select exists(select * from `workspace_members` where `user_id` = 1 and `workspace_members`.`deleted_at` is null) as `exists`
---
    public function hasWorkspace()
    {
        $userId = Auth::id();


        $isWorkspace = WorkspaceMember::query()
            ->where('user_id', $userId)
            ->exists();